app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "isbn", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "harry potter"], ["author", "jk rowling"], ["isbn", "1234"], ["genre", "adventure"], ["created_at", "2015-06-26 05:06:48.211389"], ["updated_at", "2015-06-26 05:06:48.211389"]]

  def show
    @book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 19]]

  def destroy
    @book = Book.find_by(id: params[:id])
    if @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]