app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @book = Book.find_by(id: params[:book_id])
    @review.book = @book

    if @review.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 19]]
INSERT INTO "reviews" ("rating", "body", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", "70"], ["body", "cat in hat good"], ["book_id", 19], ["created_at", "2015-06-26 06:49:14.859246"], ["updated_at", "2015-06-26 06:49:14.859246"]]